---
kind: method
id: M:Autodesk.Revit.DB.View.GetPointCloudOverrides
zh: 视图
source: html/08c94e04-8c83-4d28-dccb-ddccec1487d9.htm
---
# Autodesk.Revit.DB.View.GetPointCloudOverrides Method

**中文**: 视图

Returns point cloud overrides object for the view.

## Syntax (C#)
```csharp
public PointCloudOverrides GetPointCloudOverrides()
```

## Returns
Point cloud overrides for the view